mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/STM32_WPAN/App/app_thread.c
	/* Init config buffer and call TL_THREAD_Init */
	APP_THREAD_TL_THREAD_INIT();

	/* Configure UART for sending CLI command from M4 */
	APP_THREAD_Init_UART_CLI();

	/* Send Thread start system cmd to M0 */
	ThreadInitStatus = SHCI_C2_THREAD_Init();

	/* Prevent unused argument(s) compilation warning */
	UNUSED(ThreadInitStatus);

	/* USER CODE BEGIN APP_THREAD_INIT_TIMER */

	/* USER CODE END APP_THREAD_INIT_TIMER */

	/* Create the different FreeRTOS tasks requested to run this Thread application*/
	OsTaskMsgM0ToM4Id = osThreadNew(APP_THREAD_FreeRTOSProcessMsgM0ToM4Task, NULL, &ThreadMsgM0ToM4Process_attr);

	/* USER CODE BEGIN APP_THREAD_INIT_FREERTOS */

	/* USER CODE END APP_THREAD_INIT_FREERTOS */

	/* Configure the Thread device at start */
	APP_THREAD_DeviceConfig();

	/* USER CODE BEGIN APP_THREAD_INIT_2 */

	/* USER CODE END APP_THREAD_INIT_2 */
}

/**
 * @brief  Trace the error or the warning reported.
 * @param  ErrId :
 * @param  ErrCode
 * @retval None
 */
void APP_THREAD_Error(uint32_t ErrId, uint32_t ErrCode) {
	/* USER CODE BEGIN APP_THREAD_Error_1 */

	/* USER CODE END APP_THREAD_Error_1 */
	switch (ErrId) {
	case ERR_REC_MULTI_MSG_FROM_M0:
		APP_THREAD_TraceError("ERROR : ERR_REC_MULTI_MSG_FROM_M0 ", ErrCode);
		break;
	case ERR_THREAD_SET_STATE_CB:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_STATE_CB ", ErrCode);
		break;
	case ERR_THREAD_SET_CHANNEL:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_CHANNEL ", ErrCode);
		break;
	case ERR_THREAD_SET_PANID:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_PANID ", ErrCode);
		break;
	case ERR_THREAD_IPV6_ENABLE:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_IPV6_ENABLE ", ErrCode);
		break;
	case ERR_THREAD_START:
		APP_THREAD_TraceError("ERROR: ERR_THREAD_START ", ErrCode);
		break;
	case ERR_THREAD_ERASE_PERSISTENT_INFO:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_ERASE_PERSISTENT_INFO ", ErrCode);
		break;
	case ERR_THREAD_CHECK_WIRELESS:
		APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ", ErrCode);
		break;
		/* USER CODE BEGIN APP_THREAD_Error_2 */

		/* USER CODE END APP_THREAD_Error_2 */
	default:
		APP_THREAD_TraceError("ERROR Unknown ", 0);
		break;
	}
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief Thread initialization.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void) {
	otError error;
	error = otInstanceErasePersistentInfo(NULL);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_ERASE_PERSISTENT_INFO, error);
	}
	otInstanceFinalize(NULL);
	otInstanceInitSingle();
	error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_SET_STATE_CB, error);
	}
	error = otLinkSetChannel(NULL, C_CHANNEL_NB);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_SET_CHANNEL, error);
	}
	error = otLinkSetPanId(NULL, C_PANID);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_SET_PANID, error);
	}
	error = otIp6SetEnabled(NULL, true);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
	}
	error = otThreadSetEnabled(NULL, true);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_START, error);
	}

	/* USER CODE BEGIN DEVICECONFIG */
	error = otThreadSetEnabled(NULL, false);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_START, error);
	}

	error = otIp6SetEnabled(NULL, false);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
	}

	error = otPlatRadioSetTransmitPower(NULL, TRANSMIT_POWER);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_SET_CHANNEL, error);
	}

	otChildSupervisionSetCheckTimeout(NULL, CHILD_SUPERVISION_TIMEOUT);
	otChildSupervisionSetInterval(NULL, CHILD_SUPERVISION_INTERVAL);

//   error = otIp6AddressFromString("ff12::1", &multicastAddr);
//   error = otIp6SubscribeMulticastAddress(NULL, &multicastAddr);

	error = otThreadSetMasterKey(NULL, &masterKey);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_SET_CHANNEL, error);
	}

	error = otThreadSetNetworkName(NULL, networkName);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_SET_CHANNEL, error);
	}
	error = otThreadSetExtendedPanId(NULL, &extendedPanId);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_SET_CHANNEL, error);
	}

	error = otIp6SetEnabled(NULL, true);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE, error);
	}

	error = otThreadSetEnabled(NULL, true);
	if (error != OT_ERROR_NONE) {
		APP_THREAD_Error(ERR_THREAD_START, error);
	}

	error = otCoapStart(NULL, OT_DEFAULT_COAP_PORT);
	//  error = otCoapAddResource(NULL, &OT_Light_Ressource);
	error = otCoapAddResource(NULL, &OT_Lights_Complex_Ressource);
	error = otCoapAddResource(NULL, &OT_Lights_Simple_Ressource);
	error = otCoapAddResource(NULL, &OT_Border_Time_Ressource);
	error = otCoapAddResource(NULL, &OT_Node_Info_Ressource);
#ifndef DONGLE_CODE
    error = otCoapAddResource(NULL, &OT_Toggle_Logging_Ressource);
#endif
	// set default multicast address for border router
//    otIp6AddressFromString("ff03::1", &borderRouter.ipv6);
	otIp6AddressFromString("ff03::1", &multicastAddr);
	memcpy(&borderRouter.ipv6, &multicastAddr, sizeof(multicastAddr));

	// set UID in local state variable
//	msgSendMyIP.uid = (uint32_t)  DBGMCU->IDCODE;
//	 = UID64_BASE;
	stm32UID(msgSendMyIP.uid);

	/* USER CODE END DEVICECONFIG */
}

/**
 * @brief Thread notification when the state changes.
 * @param  aFlags  : Define the item that has been modified
 *         aContext: Context
 *
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext) {
	/* Prevent unused argument(s) compilation warning */
	UNUSED(pContext);

	/* USER CODE BEGIN APP_THREAD_STATENOTIF */

	/* USER CODE END APP_THREAD_STATENOTIF */

	if ((NotifFlags & (uint32_t) OT_CHANGED_THREAD_ROLE) == (uint32_t) OT_CHANGED_THREAD_ROLE) {
		switch (otThreadGetDeviceRole(NULL)) {
		case OT_DEVICE_ROLE_DISABLED:
			/* USER CODE BEGIN OT_DEVICE_ROLE_DISABLED */
			borderRouter.epoch = 0;
			/* USER CODE END OT_DEVICE_ROLE_DISABLED */
			break;
		case OT_DEVICE_ROLE_DETACHED:
			/* USER CODE BEGIN OT_DEVICE_ROLE_DETACHED */
			borderRouter.epoch = 0;
			/* USER CODE END OT_DEVICE_ROLE_DETACHED */
			break;
		case OT_DEVICE_ROLE_CHILD:
			/* USER CODE BEGIN OT_DEVICE_ROLE_CHILD */
#ifdef DONGLE_CODE
			BSP_LED_On(LED_GREEN);
			BSP_LED_Off(LED_RED);
			BSP_LED_Off(LED_BLUE);
#endif
			APP_THREAD_UpdateBorderRouter();
			/* USER CODE END OT_DEVICE_ROLE_CHILD */
			break;
		case OT_DEVICE_ROLE_ROUTER:
			/* USER CODE BEGIN OT_DEVICE_ROLE_ROUTER */
#ifdef DONGLE_CODE
			BSP_LED_Off(LED_GREEN);
			BSP_LED_Off(LED_RED);
			BSP_LED_On(LED_BLUE);
#endif
			APP_THREAD_UpdateBorderRouter();
			/* USER CODE END OT_DEVICE_ROLE_ROUTER */
			break;
		case OT_DEVICE_ROLE_LEADER:
			/* USER CODE BEGIN OT_DEVICE_ROLE_LEADER */
#ifdef DONGLE_CODE
			BSP_LED_On(LED_GREEN);
			BSP_LED_Off(LED_RED);
			BSP_LED_On(LED_BLUE);
#endif
			APP_THREAD_UpdateBorderRouter();
			/* USER CODE END OT_DEVICE_ROLE_LEADER */
			break;
		default:
			/* USER CODE BEGIN DEFAULT */
			APP_THREAD_UpdateBorderRouter();
			/* USER CODE END DEFAULT */
			break;
		}
	}
}

/**
 * @brief  Warn the user that an error has occurred.In this case,
 *         the LEDs on the Board will start blinking.
 *
 * @param  pMess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_TraceError(const char *pMess, uint32_t ErrCode) {
	/* USER CODE BEGIN TRACE_ERROR */

	/* USER CODE END TRACE_ERROR */
}

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Thread
 *        and display associated informations
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckWirelessFirmwareInfo(void) {
	WirelessFwInfo_t wireless_info_instance;
	WirelessFwInfo_t *p_wireless_info = &wireless_info_instance;

