mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/STM32_WPAN/App/app_thread.c
	if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success) {
		APP_THREAD_Error((uint32_t) ERR_THREAD_CHECK_WIRELESS, (uint32_t) ERR_INTERFACE_FATAL);
	} else {
		APP_DBG("**********************************************************");
		APP_DBG("WIRELESS COPROCESSOR FW:");
		/* Print version */
		APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor,
				p_wireless_info->VersionSub);

		switch (p_wireless_info->StackType) {
		case INFO_STACK_TYPE_THREAD_FTD:
			APP_DBG("FW Type : Thread FTD")
			;
			break;
		case INFO_STACK_TYPE_THREAD_MTD:
			APP_DBG("FW Type : Thread MTD")
			;
			break;
		case INFO_STACK_TYPE_BLE_THREAD_FTD_STATIC:
			APP_DBG("FW Type : Static Concurrent Mode BLE/Thread")
			;
			break;
		default:
			/* No Thread device supported ! */
			APP_THREAD_Error((uint32_t) ERR_THREAD_CHECK_WIRELESS, (uint32_t) ERR_INTERFACE_FATAL);
			break;
		}
		APP_DBG("**********************************************************");
	}
}

/*************************************************************
 *
 * FREERTOS WRAPPER FUNCTIONS
 *
 *************************************************************/
static void APP_THREAD_FreeRTOSProcessMsgM0ToM4Task(void *argument) {
	UNUSED(argument);
	for (;;) {
		/* USER CODE BEGIN APP_THREAD_FREERTOS_PROCESS_MSG_M0_TO_M4_1 */

		/* USER END END APP_THREAD_FREERTOS_PROCESS_MSG_M0_TO_M4_1 */
		osThreadFlagsWait(1, osFlagsWaitAll, osWaitForever);
		APP_THREAD_ProcessMsgM0ToM4();
		/* USER CODE BEGIN APP_THREAD_FREERTOS_PROCESS_MSG_M0_TO_M4_2 */

		/* USER END END APP_THREAD_FREERTOS_PROCESS_MSG_M0_TO_M4_2 */
	}
}

#if (CFG_FULL_LOW_POWER == 0)
static void APP_THREAD_FreeRTOSSendCLIToM0Task(void *argument) {
	UNUSED(argument);
	for (;;) {
		/* USER CODE BEGIN APP_THREAD_FREERTOS_SEND_CLI_TO_M0_1 */

		/* USER END END APP_THREAD_FREERTOS_SEND_CLI_TO_M0_1 */
		osThreadFlagsWait(1, osFlagsWaitAll, osWaitForever);
		Send_CLI_To_M0();
		/* USER CODE BEGIN APP_THREAD_FREERTOS_SEND_CLI_TO_M0_2 */

		/* USER END END APP_THREAD_FREERTOS_SEND_CLI_TO_M0_2 */
	}
}
#endif /* (CFG_FULL_LOW_POWER == 0) */

/* USER CODE BEGIN FREERTOS_WRAPPER_FUNCTIONS */
void stm32UID(uint8_t* uid) {
  for(uint8_t i = 0; i < 12; i++) {
    uid[i] = *(volatile uint8_t *)(UID_BASE + i);
    }
  }
/* USER CODE END FREERTOS_WRAPPER_FUNCTIONS */

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
static void APP_THREAD_DummyRespHandler(void *p_context, otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo, otError Result) {
	/* Prevent unused argument(s) compilation warning */
	UNUSED(p_context);
	UNUSED(pHeader);
	UNUSED(pMessage);
	UNUSED(pMessageInfo);
	UNUSED(Result);
}

static void APP_THREAD_CoapRespHandler_UpdateBorderRouter(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo, otError Result) {

	if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &receivedSystemCal, sizeof(receivedSystemCal))
			== sizeof(receivedSystemCal)) {

			// if successful, update border router state variable
			memcpy(&borderRouter, &receivedSystemCal, sizeof(receivedSystemCal));

			// update the onboard RTC unix time
			updateRTC(borderRouter.epoch);
	}

}

/**
 * @brief Dummy request handler
 * @param
 * @retval None
 */
static void APP_THREAD_DummyReqHandler(void *p_context, otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	tempMessageInfo = pMessageInfo;
	receivedMessage = (otMessageInfo*) pMessage;
}

//void APP_THREAD_GetBorderRouterIP(){
//	APP_THREAD_SendCoapUnicastRequest(NULL, NULL, MULICAST_FTD_BORDER_ROUTER, borderSyncResource);
//}


//char msgSendMyIP[5] = "cal";
////otIp6Address* test_ip;
//otNeighborInfo test_info_neighbor;
//otNeighborInfoIterator test_neighbor_iterator;
//otError error;
//
//volatile uint8_t random_var = 0;
//volatile bool state = 1;
//volatile otNetifMulticastAddress *test_addr;
//volatile otExtAddress *test_ext_addr;
//volatile otExtAddress test_1;
//volatile otExtAddress test_2;

void APP_THREAD_UpdateBorderRouter() {

	// if border router IP is still multicast (ff03::1), attempt to sync
	if (otIp6IsAddressEqual(&multicastAddr, &borderRouter.ipv6)) {
		APP_THREAD_SyncWithBorderRouter();
	}

	// send IP to border router
	APP_THREAD_SendMyInfo();
}

// send a GET request to border router via multicast
void APP_THREAD_SyncWithBorderRouter() {
	APP_THREAD_SendCoapMsgForBorderSync(NULL, 0, &multicastAddr, borderSyncResource, REQUEST_ACK, OT_COAP_CODE_GET, 1U);
}

void APP_THREAD_SendMyInfo() {
//	msgSendMyIP.uid = DBGMCU->IDCODE;
//	const otIp6Address *test_ip = otThreadGetLinkLocalIp6Address(NULL);
//	if(test_ip) random_var++;
//	state = otIp6IsMulticastPromiscuousEnabled(NULL);
//	test_addr = otIp6GetMulticastAddresses(NULL);
//	test_ext_addr = otLinkGetExtendedAddress(NULL);
//	memcpy(&test_1, test_ext_addr, sizeof(otExtAddress));
////	test_1 = test_ext_addr[0];
////	test_2 = &test_ext_addr;
//
//	error = otThreadGetNextNeighborInfo(NULL, &test_neighbor_iterator, &test_info_neighbor);
	// TODO: does this need an ACK
	APP_THREAD_SendCoapMsg(&msgSendMyIP, sizeof(msgSendMyIP), &borderRouter.ipv6, nodeInfoResource, REQUEST_ACK,
			OT_COAP_CODE_PUT, 1U);
//	APP_THREAD_SendCoapUnicastMsg(NULL, NULL, borderRouter.ipv6  , borderSyncResource, 1U);
}

void APP_THREAD_SendBorderMessage(void *packet, uint8_t len) {
//	APP_THREAD_SendCoapMsg(sensorPacket, borderRouter.ipv6, borderPacket, otCoapType type);
	APP_THREAD_SendCoapMsg(packet, len, &borderRouter.ipv6, borderPacket, REQUEST_ACK, OT_COAP_CODE_PUT, 1U);
}

void APP_THREAD_SendBorderPacket(struct LogPacket *sensorPacket) {
//	APP_THREAD_SendCoapMsg(sensorPacket, borderRouter.ipv6, borderPacket, otCoapType type);
	APP_THREAD_SendCoapMsg(sensorPacket, sizeof(struct LogPacket), &borderRouter.ipv6, borderPacket, NO_ACK,
			OT_COAP_CODE_PUT, 1U);

}

static void APP_THREAD_CoapLightsSimpleRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {

		// if get, send response with current log message
		if (otCoapHeaderGetType(pHeader) == OT_COAP_CODE_GET) {
			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, &lightsSimpleMessage, sizeof(lightsSimpleMessage));
			break;
		}

