mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/STM32_WPAN/App/app_thread.c
		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &lightsSimpleMessage, sizeof(lightsSimpleMessage))
				== 4U) {
			if ((otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_PUT)
					|| (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_POST)) {
				osMessageQueuePut(lightsSimpleQueueHandle, &lightsSimpleMessage, 0U, 0U);
			}

		}

		tempMessageInfo = pMessageInfo;
		receivedMessage = (otMessageInfo*) pMessage;

		if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, NULL, 0);
			break;
		}

		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U) {
			//APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
		}

		if (OT_ReceivedCommand == 1U) {
			//BSP_LED_Toggle(LED1);
		}
	} while (false);
}

// request handler for when receiving a message directed at the data logging resource
static void APP_THREAD_CoapToggleLoggingRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
		// if get, send response with current log message
		if (otCoapHeaderGetType(pHeader) == OT_COAP_CODE_GET) {
			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, &logMessage, sizeof(logMessage));
			break;
		}

		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &logMessage, sizeof(logMessage))
				== sizeof(logMessage)) {
			// if post or put, add to queue for masterthread processing
			if ((otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_PUT)
					|| (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_POST)) {
				osMessageQueuePut(togLoggingQueueHandle, &logMessage, 0U, 0U);
			}
		}

		tempMessageInfo = pMessageInfo;
		receivedMessage = (otMessageInfo*) pMessage;

		if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, NULL, 0);
			break;
		}

		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U) {
			//APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
		}

		if (OT_ReceivedCommand == 1U) {
			//BSP_LED_Toggle(LED1);
		}

	} while (false);
}

volatile char temp_var[100];
volatile uint8_t temp_num = 0;

// request handler for when receiving a message directed at the border router synchronizing resource
static void APP_THREAD_CoapBorderTimeRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
#ifdef DONGLE_CODE
		BSP_LED_Toggle(LED_RED);
#endif
		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &receivedSystemCal, sizeof(receivedSystemCal))
				== sizeof(receivedSystemCal)) {
			// if the message was a put request, copy message over to border router info struct
			if ((otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_PUT)
					|| (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_POST)) {

				memcpy(&borderRouter, &receivedSystemCal, sizeof(receivedSystemCal));

				// update the onboard RTC unix time
				updateRTC(borderRouter.epoch);
			}
		}

		receivedMessage = (otMessageInfo*) pMessage;

		if (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET) {

			//TODO: this is where you would put the return if you wanted a node to transmit BR info to other nodes
			//APP_THREAD_SendDataResponse(pHeader, pMessageInfo, &borderRouter, sizeof(borderRouter));

			break;
		}

		if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, NULL, 0);
			break;
		}

	} while (false);
}

// Only get requests allowed for this resource
struct sendIP_struct tempVar = {"test","test",0};
//char test_string[200] = "test";
static void APP_THREAD_CoapNodeInfoRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
#ifdef DONGLE_CODE
		BSP_LED_Toggle(LED_RED);
#endif

		if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &tempVar, sizeof(tempVar))
				== sizeof(tempVar)) {
			// if the message was a put request, copy message over to border router info struct
//			if ((otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_PUT)
//					|| (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_POST)) {
//
//				memcpy(&borderRouter, &receivedSystemCal, sizeof(receivedSystemCal));
//
//				// update the onboard RTC unix time
//				updateRTC(borderRouter.epoch);
//			}
		}

		receivedMessage = (otMessageInfo*) pMessage;

		// send info if requested
		if (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET) {
//			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, &msgSendMyIP, sizeof(msgSendMyIP));
			APP_THREAD_SendMyInfo();
//			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, &tempVar, sizeof(tempVar));

//			break;
		}

		if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE) {
			APP_THREAD_SendDataResponse(pHeader, pMessageInfo, NULL, 0);
		}

	} while (false);
}

void updateRTC(time_t now) {

	RTC_TimeTypeDef sTime;
	RTC_DateTypeDef sDate;

	// https://www.st.com/content/ccc/resource/technical/document/application_note/2a/c2/6f/74/fa/0d/46/3a/CD00015424.pdf/files/CD00015424.pdf/jcr:content/translations/en.CD00015424.pdf
	struct tm *time_tm;

	RTC_FromEpoch(now, &sTime, &sDate);

	if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK) {
	}

	/*
	 * update the RTC
	 */
	if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK) {
	}

	HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, 0x32F2); // lock it in with the backup registers
}

/**
 * @brief  This function compute the next message to be send
 * @param  None
 * @retval None
 */
//static void APP_THREAD_SendNextBuffer(void)
//{
//  uint16_t j;
//  uint16_t mOffset;
//
//  if (OT_BufferIdSend < 5U)
//  {
//    /* Prepare next buffers to be send */
//    OT_BufferIdSend++;
//    mOffset=(OT_BufferIdSend - 1U) * COAP_PAYLOAD_MAX_LENGTH;
//
//    memset(OT_BufferSend, 0, COAP_PAYLOAD_MAX_LENGTH);
//    for(j = mOffset; j < mOffset + COAP_PAYLOAD_MAX_LENGTH; j++)
//    {
//      OT_BufferSend[j - mOffset] = aDataBuffer[j];
//    }
//
//    /* Send the data in unicast mode */
//    APP_THREAD_SendCoapUnicastRequest();
//  }
//  else
//  {
//    /* Buffer transfer has been successfully  transfered */
//    BSP_LED_On(LED1);
//    APP_DBG(" ********* BUFFER HAS BEEN TRANFERED \r\n");
//  }
//}
static void APP_THREAD_CoapLightsComplexRequestHandler(otCoapHeader *pHeader, otMessage *pMessage,
		const otMessageInfo *pMessageInfo) {
	do {
		//APP_THREAD_SendCoapUnicastRequest();

